imbluedabr/m33mu/cpu/stm32l552/stm32l552_mmio.c
#define TZSC_SECCFGR2_OFFSET 0x14u
#define TZSC_AESSEC_BIT 12u
#define TZSC_HASHSEC_BIT 13u
#define TZSC_RNGSEC_BIT 14u
#define TZSC_PKASEC_BIT 15u

/* EXTI offsets (subset) */
#define EXTI_RTSR1  0x000u
#define EXTI_FTSR1  0x004u
#define EXTI_SWIER1 0x008u
#define EXTI_RPR1   0x00Cu
#define EXTI_FPR1   0x010u
#define EXTI_EXTICR1 0x060u
#define EXTI_EXTICR2 0x064u
#define EXTI_EXTICR3 0x068u
#define EXTI_EXTICR4 0x06Cu
#define EXTI_IMR1   0x080u
#define EXTI_EMR1   0x084u

/* WWDG offsets */
#define WWDG_CR  0x000u
#define WWDG_CFR 0x004u
#define WWDG_SR  0x008u

/* IWDG offsets */
#define IWDG_KR   0x000u
#define IWDG_PR   0x004u
#define IWDG_RLR  0x008u
#define IWDG_SR   0x00Cu
#define IWDG_WINR 0x010u
#define IWDG_EWCR 0x014u

#define GPIO_IDR_OFFSET 0x10u
#define GPIO_ODR_OFFSET 0x14u

/* MPCBB offsets */
#define MPCBB_CR_OFFSET      0x000u
#define MPCBB_SECCFGR_OFFSET 0x100u
#define MPCBB_CR_INVSECSTATE (1u << 30)

/* FLASH register offsets */
#define FLASH_ACR      0x000u
#define FLASH_NSKEYR   0x004u
#define FLASH_SECKEYR  0x008u
#define FLASH_NSSR     0x020u
#define FLASH_SECSR    0x024u
#define FLASH_NSCR     0x028u
#define FLASH_SECCR    0x02cu
#define FLASH_NSCCR    0x030u
#define FLASH_SECCCR   0x034u
#define FLASH_OPTR     0x040u

#define FLASH_KEY1 0x45670123u
#define FLASH_KEY2 0xCDEF89ABu

#define FLASH_FLAG_BSY (1u << 0)
#define FLASH_FLAG_EOP (1u << 16)

#define FLASH_CR_LOCK (1u << 0)
#define FLASH_CR_PG   (1u << 1)
#define FLASH_CR_SER  (1u << 2)
#define FLASH_CR_BER  (1u << 3)
#define FLASH_CR_STRT (1u << 5)
#define FLASH_CR_SNB_SHIFT 6
#define FLASH_CR_SNB_MASK (0x7fu << FLASH_CR_SNB_SHIFT)

#define FLASH_SECTOR_COUNT 128u
#define FLASH_BANK_COUNT   2u
#define FLASH_CR_BKSEL     (1u << 31)
#define FLASH_OPTR_SWAP_BANK (1u << 20)
#define FLASH_OPTR_DBANK (1u << 22)

struct rcc_state {
    mm_u32 regs[RCC_SIZE / 4];
    mm_u64 cpu_hz;
};

struct pwr_state {
    mm_u32 regs[PWR_SIZE / 4];
};

struct simple_blk {
    mm_u32 regs[GTZC_BLK_SIZE / 4];
};

struct mpcbb_state {
    mm_u32 regs[MPCBB_SIZE / 4];
};

struct rng_state {
    mm_u32 regs[RNG_SIZE / 4];
    mm_u32 dr;
    mm_bool dr_valid;
};

#include "stm32_crypto_priv.h"

struct exti_state {
    mm_u32 regs[EXTI_SIZE / 4];
};

struct iwdg_state {
    mm_u32 regs[IWDG_SIZE / 4];
    mm_u32 counter;
    mm_u32 prescaler;
    mm_bool running;
    mm_bool write_access;
    mm_u64 accum;
};

struct wwdg_state {
    mm_u32 regs[WWDG_SIZE / 4];
    mm_u32 counter;
    mm_u64 accum;
};

struct flash_state {
    mm_u32 regs[FLASH_SIZE / 4];
    mm_u8 *flash;
    mm_u32 flash_size;
    mm_u32 base_s;
    mm_u32 base_ns;
    const struct mm_flash_persist *persist;
    mm_u32 flags;
    mm_u8 ns_key_stage;
    mm_u8 sec_key_stage;
    mm_bool dualbank_enabled;
    mm_bool swap_active;
};

struct gpio_state {
    mm_u32 regs[0x34 / 4]; /* up to SECCFGR */
};

struct gpdma_state {
    mm_u32 regs[0x1000 / 4];
};

struct ucpd_state {
    mm_u32 cfgr1;
    mm_u32 cr;
    mm_u32 imr;
    mm_u32 sr;
};

/* uintptr_t substitute for C90 */
typedef unsigned long mm_uptr;

static void rcc_update_ready(struct rcc_state *r);
static void rcc_update_sysclk(struct rcc_state *r);
static void pwr_update_vos(struct pwr_state *p);
static void mpcbb_init_defaults(void);
static void flash_sync_option_regs(struct flash_state *f);

static struct rcc_state rcc;
static struct pwr_state pwr;
static struct simple_blk tzsc_s;
static struct simple_blk tzsc_ns;
static struct simple_blk tzic_s;
static struct simple_blk tzic_ns;
static struct simple_blk crs;
static struct simple_blk crs_sec;
static struct ucpd_state ucpd1_state;
static struct ucpd_state ucpd1_state_sec;
static struct mpcbb_state mpcbb[2];
static struct rng_state rng;
static struct hash_state hash_accel;
static struct aes_state aes_accel;
static struct pka_state pka_accel;
static struct exti_state exti;
static struct iwdg_state iwdg;
static struct wwdg_state wwdg;
static struct flash_state flash_ctl;
static struct gpio_state gpio[9]; /* A..I */
static struct gpdma_state gpdma1;
static void *gpio_ctx[18][4];
static void *rng_ctx[2][4];
static struct hash_ctx hash_ctx[2];
static struct aes_ctx aes_ctx[2];
static struct pka_ctx pka_ctx[2];
static struct mm_nvic *g_rng_nvic = 0;
static struct mm_nvic *g_exti_nvic = 0;
static struct mm_nvic *g_wdg_nvic = 0;

#define RNG_IRQ 94
static const mm_u32 mpcbb_words[] = { 32u, 32u };

static mm_u32 stm32l552_gpio_bank_read(void *opaque, int bank);
static mm_u32 stm32l552_gpio_bank_read_moder(void *opaque, int bank);
static mm_bool stm32l552_gpio_bank_clock(void *opaque, int bank);
static mm_u32 stm32l552_gpio_bank_read_seccfgr(void *opaque, int bank);
static void exti_gpio_update(int bank, mm_u32 old_level, mm_u32 new_level);

static void ucpd_update_attach(struct ucpd_state *u)
{
    if (u == 0) {
        return;
    }
    if ((u->cfgr1 & UCPD_CFGR1_UCPDEN) == 0u) {
        return;
    }
    if ((u->cr & (UCPD_CR_ANAMODE | UCPD_CR_CCENABLE_BOTH)) != (UCPD_CR_ANAMODE | UCPD_CR_CCENABLE_BOTH)) {
        return;
    }
    if ((u->sr & (UCPD_SR_TYPECEVT1 | UCPD_SR_TYPECEVT2)) == 0u) {
        u->sr |= UCPD_SR_TYPECEVT1;
    }
    u->sr &= ~(UCPD_SR_TYPEC_VSTATE_CC_Msk | UCPD_SR_TYPEC_VSTATE_CC2_Msk);
    u->sr |= (3u << UCPD_SR_TYPEC_VSTATE_CC1_Pos);
}

static mm_bool ucpd_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct ucpd_state *u = (struct ucpd_state *)opaque;
    mm_u32 value = 0;
    if (u == 0 || value_out == 0) {
        return MM_FALSE;
    }
    if (size_bytes != 4u) {
        return MM_FALSE;
    }
    ucpd_update_attach(u);
    switch (offset) {
    case UCPD_CFGR1:
        value = u->cfgr1;
        break;
    case UCPD_CR:
        value = u->cr;
        break;
    case UCPD_IMR:
        value = u->imr;
        break;
    case UCPD_SR:
        value = u->sr;
        break;
    default:
        value = 0;
        break;
    }
    *value_out = value;
    return MM_TRUE;
}

static mm_bool ucpd_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct ucpd_state *u = (struct ucpd_state *)opaque;
    if (u == 0) {
        return MM_FALSE;
    }
    if (size_bytes != 4u) {
        return MM_FALSE;
    }
    switch (offset) {
    case UCPD_CFGR1:
        u->cfgr1 = value;
        ucpd_update_attach(u);
        return MM_TRUE;
    case UCPD_CR:
        u->cr = value;
        ucpd_update_attach(u);
        return MM_TRUE;
    case UCPD_IMR:
        u->imr = value;
        return MM_TRUE;
    case UCPD_ICR:
        if ((value & UCPD_ICR_TYPECEVT1CF) != 0u) {
            u->sr &= ~UCPD_SR_TYPECEVT1;
        }
        if ((value & UCPD_ICR_TYPECEVT2CF) != 0u) {
            u->sr &= ~UCPD_SR_TYPECEVT2;
        }
        return MM_TRUE;
    default:
        return MM_TRUE;
    }
}

static mm_bool tzsc_requires_secure(const struct simple_blk *tzsc, mm_u32 bit)
{
    mm_u32 seccfgr2 = tzsc->regs[TZSC_SECCFGR2_OFFSET / 4u];
    return ((seccfgr2 >> bit) & 1u) != 0u;
}

