imbluedabr/m33mu/cpu/stm32l552/stm32l552_mmio.c
static mm_u32 rcc_bus_reg(const struct rcc_state *r, enum rcc_bus_kind bus)
{
    if (r == 0) {
        return 0u;
    }
    switch (bus) {
    case RCC_BUS_AHB2:
        return r->regs[0x4c / 4];
    case RCC_BUS_APB1:
        return r->regs[0x58 / 4];
    case RCC_BUS_APB1_2:
        return r->regs[0x5c / 4];
    case RCC_BUS_APB2:
        return r->regs[0x60 / 4];
    default:
        return 0u;
    }
}

static const char *rcc_bus_name(enum rcc_bus_kind bus)
{
    switch (bus) {
    case RCC_BUS_AHB2: return "AHB2";
    case RCC_BUS_APB1: return "APB1";
    case RCC_BUS_APB1_2: return "APB1_2";
    case RCC_BUS_APB2: return "APB2";
    default: return "RCC";
    }
}

static mm_bool stm32l552_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len)
{
    enum rcc_bus_kind bus;
    int line_idx = 0;
    size_t i;
    (void)opaque;
    if (out == 0 || out_len == 0u) {
        return MM_FALSE;
    }
    for (bus = RCC_BUS_AHB2; bus <= RCC_BUS_APB2; ++bus) {
        mm_u32 reg = rcc_bus_reg(&rcc, bus);
        char buf[256];
        size_t pos = 0;
        mm_bool have = MM_FALSE;
        if (reg == 0u) {
            continue;
        }
        pos += snprintf(buf + pos, sizeof(buf) - pos, "%s:", rcc_bus_name(bus));
        for (i = 0; i < sizeof(rcc_clk_names) / sizeof(rcc_clk_names[0]); ++i) {
            if (rcc_clk_names[i].bus != bus) {
                continue;
            }
            if ((reg & (1u << rcc_clk_names[i].bit)) == 0u) {
                continue;
            }
            if (pos + 2u < sizeof(buf)) {
                pos += snprintf(buf + pos, sizeof(buf) - pos, " %s", rcc_clk_names[i].name);
                have = MM_TRUE;
            }
        }
        if (!have) {
            continue;
        }
        if (line_idx == line) {
            snprintf(out, out_len, "%s", buf);
            return MM_TRUE;
        }
        line_idx++;
    }
    return MM_FALSE;
}

static mm_u32 stm32l552_gpio_bank_read(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x14u / 4];
}

static mm_u32 stm32l552_gpio_bank_read_moder(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x00u / 4];
}

static mm_bool stm32l552_gpio_bank_clock(void *opaque, int bank)
{
    (void)opaque;
    return gpio_clock_enabled(&rcc, bank);
}

static mm_u32 stm32l552_gpio_bank_read_seccfgr(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x30u / 4];
}

static mm_bool rng_clock_enabled(const struct rcc_state *rcc)
{
    /* RCC_AHB2ENR offset 0x4C, RNGEN bit18 */
    mm_u32 ahb2enr = rcc->regs[0x4c / 4];
    return ((ahb2enr >> 18) & 1u) != 0u;
}

static mm_bool rng_requires_secure(const struct simple_blk *tzsc)
{
    return tzsc_requires_secure(tzsc, TZSC_RNGSEC_BIT);
}

static void rng_fill(struct rng_state *r)
{
    mm_u32 v = 0;
    ssize_t n = getrandom(&v, sizeof(v), GRND_NONBLOCK);
    if (n != (ssize_t)sizeof(v)) {
        v = 0;
    }
    r->dr = v;
    r->dr_valid = MM_TRUE;
    r->regs[RNG_SR_OFFSET / 4] |= 1u;
    if (g_rng_nvic != 0 && (r->regs[RNG_CR_OFFSET / 4] & (1u << 3)) != 0u) {
        mm_nvic_set_pending(g_rng_nvic, (mm_u32)RNG_IRQ, MM_TRUE);
    }
}

static mm_u32 flash_bank_count(const struct flash_state *f)
{
    if (f == 0) {
        return 1u;
    }
    return f->dualbank_enabled ? FLASH_BANK_COUNT : 1u;
}

static void flash_apply_bank_swap(struct flash_state *f)
{
    mm_u32 bank_size;
    mm_u32 i;
    if (f == 0 || f->flash == 0 || f->flash_size == 0u) {
        return;
    }
    if ((f->flash_size % 2u) != 0u) {
        return;
    }
    bank_size = f->flash_size / 2u;
    for (i = 0; i < bank_size; ++i) {
        mm_u8 tmp = f->flash[i];
        f->flash[i] = f->flash[i + bank_size];
        f->flash[i + bank_size] = tmp;
    }
    if (f->persist != 0 && f->persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)f->persist, 0u, f->flash_size);
    }
}

static void flash_set_swap_state(struct flash_state *f, mm_bool swap_active)
{
    if (f == 0) {
        return;
    }
    if (!f->dualbank_enabled) {
        f->swap_active = MM_FALSE;
        return;
    }
    if (f->swap_active == swap_active) {
        return;
    }
    f->swap_active = swap_active;
    flash_apply_bank_swap(f);
}

static void flash_sync_option_regs(struct flash_state *f)
{
    mm_u32 val;
    if (f == 0) {
        return;
    }
    if (!f->dualbank_enabled) {
        f->swap_active = MM_FALSE;
    }
    val = f->regs[FLASH_OPTR / 4u];
    val &= ~(FLASH_OPTR_SWAP_BANK | FLASH_OPTR_DBANK);
    if (f->swap_active) {
        val |= FLASH_OPTR_SWAP_BANK;
    }
    if (f->dualbank_enabled) {
        val |= FLASH_OPTR_DBANK;
    }
    f->regs[FLASH_OPTR / 4u] = val;
}

static mm_u32 flash_sector_size(void)
{
    mm_u32 banks = flash_bank_count(&flash_ctl);
    if (flash_ctl.flash_size == 0u) {
        return 0u;
    }
    if (banks == 0u || (flash_ctl.flash_size % banks) != 0u) {
        banks = 1u;
    }
    return (FLASH_SECTOR_COUNT == 0u) ? 0u
        : ((flash_ctl.flash_size / banks) / FLASH_SECTOR_COUNT);
}

static void flash_set_busy(mm_u32 reg_offset, mm_bool busy)
{
    mm_u32 idx = reg_offset / 4u;
    if (busy) {
        flash_ctl.regs[idx] |= FLASH_FLAG_BSY;
    } else {
        flash_ctl.regs[idx] &= ~FLASH_FLAG_BSY;
    }
}

static void flash_set_eop(mm_u32 reg_offset)
{
    flash_ctl.regs[reg_offset / 4u] |= FLASH_FLAG_EOP;
}

static void flash_clear_eop(mm_u32 reg_offset)
{
    flash_ctl.regs[reg_offset / 4u] &= ~FLASH_FLAG_EOP;
}

static mm_bool flash_is_unlocked(mm_u32 reg_offset)
{
    return (flash_ctl.regs[reg_offset / 4u] & FLASH_CR_LOCK) == 0u;
}

static void flash_handle_key(mm_u32 offset, mm_u32 value)
{
    mm_u8 *stage = (offset == FLASH_NSKEYR) ? &flash_ctl.ns_key_stage : &flash_ctl.sec_key_stage;
    mm_u32 cr_off = (offset == FLASH_NSKEYR) ? FLASH_NSCR : FLASH_SECCR;
    if (*stage == 0u) {
        if (value == FLASH_KEY1) {
            *stage = 1u;
        } else {
            *stage = 0u;
        }
        return;
    }
    if (*stage == 1u) {
        if (value == FLASH_KEY2) {
            flash_ctl.regs[cr_off / 4u] &= ~FLASH_CR_LOCK;
        }
        *stage = 0u;
    }
}

