imbluedabr/m33mu/cpu/stm32l552/stm32l552_mmio.c
static void flash_apply_erase(mm_u32 cr_off, mm_u32 sr_off)
{
    mm_u32 cr = flash_ctl.regs[cr_off / 4u];
    mm_u32 sector_size = flash_sector_size();
    mm_u32 bank_size = 0;
    mm_u32 bank_offset = 0;
    mm_u32 bank_count = flash_bank_count(&flash_ctl);
    mm_u32 start = 0;
    mm_u32 length = 0;
    if (flash_ctl.flash == 0 || flash_ctl.flash_size == 0 || sector_size == 0) {
        return;
    }
    if ((cr & FLASH_CR_BER) != 0u) {
        start = 0;
        length = flash_ctl.flash_size;
    } else if ((cr & FLASH_CR_SER) != 0u) {
        mm_u32 snb = (cr & FLASH_CR_SNB_MASK) >> FLASH_CR_SNB_SHIFT;
        start = snb * sector_size;
        if (bank_count != 0u) {
            bank_size = flash_ctl.flash_size / bank_count;
        }
        if (bank_count > 1u && bank_size != 0u) {
            if ((cr & FLASH_CR_BKSEL) != 0u) {
                bank_offset = bank_size;
                start += bank_offset;
            }
        }
        if (start >= flash_ctl.flash_size) {
            return;
        }
        length = sector_size;
        if (start + length > flash_ctl.flash_size) {
            length = flash_ctl.flash_size - start;
        }
    } else {
        return;
    }
    if (flash_trace_enabled()) {
        const char *sec = (cr_off == FLASH_SECCR) ? "S" : "NS";
        const char *mode = (cr & FLASH_CR_BER) ? "BER" : "SER";
        mm_u32 snb = (cr & FLASH_CR_SNB_MASK) >> FLASH_CR_SNB_SHIFT;
        printf("[FLASH_ERASE] %s mode=%s snb=%lu start=0x%08lx len=0x%08lx\n",
               sec,
               mode,
               (unsigned long)snb,
               (unsigned long)start,
               (unsigned long)length);
    }
    flash_set_busy(sr_off, MM_TRUE);
    memset(flash_ctl.flash + start, 0xFF, length);
    flash_set_busy(sr_off, MM_FALSE);
    flash_set_eop(sr_off);
    if (flash_ctl.persist != 0 && flash_ctl.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)flash_ctl.persist, start, length);
    }
}

static mm_bool flash_write_cb(void *opaque, enum mm_sec_state sec, mm_u32 addr, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 base;
    mm_u32 offset;
    mm_u32 cr_off;
    mm_u32 sr_off;
    mm_u32 sector_size;
    mm_u32 sector_base;
    mm_u32 i;
    (void)opaque;

    if (flash_ctl.flash == 0 || flash_ctl.flash_size == 0) {
        return MM_FALSE;
    }
    if (addr >= flash_ctl.base_s && addr < flash_ctl.base_s + flash_ctl.flash_size) {
        base = flash_ctl.base_s;
    } else if (addr >= flash_ctl.base_ns && addr < flash_ctl.base_ns + flash_ctl.flash_size) {
        base = flash_ctl.base_ns;
    } else {
        return MM_FALSE;
    }
    offset = addr - base;
    cr_off = (sec == MM_SECURE) ? FLASH_SECCR : FLASH_NSCR;
    sr_off = (sec == MM_SECURE) ? FLASH_SECSR : FLASH_NSSR;

    if (offset + size_bytes > flash_ctl.flash_size) {
        return MM_FALSE;
    }
    if (flash_trace_enabled()) {
        printf("[FLASH_WRITE] %s addr=0x%08lx size=%lu value=0x%08lx\n",
               (sec == MM_SECURE) ? "S" : "NS",
               (unsigned long)addr,
               (unsigned long)size_bytes,
               (unsigned long)value);
    }
    if (!flash_is_unlocked(cr_off)) {
        return MM_TRUE;
    }
    if ((flash_ctl.regs[cr_off / 4u] & FLASH_CR_PG) == 0u) {
        return MM_TRUE;
    }

    sector_size = flash_sector_size();
    if ((flash_ctl.flags & MM_TARGET_FLAG_NVM_WRITEONCE) != 0u && sector_size != 0u) {
        sector_base = (offset / sector_size) * sector_size;
        for (i = 0; i < sector_size; ++i) {
            if (sector_base + i >= flash_ctl.flash_size) {
                break;
            }
            if (flash_ctl.flash[sector_base + i] != 0xFFu) {
                return MM_TRUE;
            }
        }
    }

    if (size_bytes == 4u) {
        flash_ctl.flash[offset] = (mm_u8)(value & 0xFFu);
        flash_ctl.flash[offset + 1u] = (mm_u8)((value >> 8) & 0xFFu);
        flash_ctl.flash[offset + 2u] = (mm_u8)((value >> 16) & 0xFFu);
        flash_ctl.flash[offset + 3u] = (mm_u8)((value >> 24) & 0xFFu);
    } else if (size_bytes == 2u) {
        flash_ctl.flash[offset] = (mm_u8)(value & 0xFFu);
        flash_ctl.flash[offset + 1u] = (mm_u8)((value >> 8) & 0xFFu);
    } else if (size_bytes == 1u) {
        flash_ctl.flash[offset] = (mm_u8)(value & 0xFFu);
    } else {
        return MM_FALSE;
    }
    flash_set_eop(sr_off);
    if (flash_ctl.persist != 0 && flash_ctl.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)flash_ctl.persist, offset, size_bytes);
    }
    return MM_TRUE;
}

/* Reset bits currently unused (could clear state if asserted). */

static mm_bool rcc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct rcc_state *r = (struct rcc_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RCC_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)r->regs + offset, size_bytes);
    return MM_TRUE;
}

static void rcc_update_ready(struct rcc_state *r)
{
    mm_u32 cr = r->regs[0]; /* offset 0x0 */
    /* Mirror RDY bits to match ON bits (immediate ready). */
    /* MSIRDY bit1 follows MSION bit0 */
    if ((cr & (1u << 0)) != 0u) cr |= (1u << 1); else cr &= ~(1u << 1);
    /* HSIRDY bit10 follows HSION bit8 */
    if ((cr & (1u << 8)) != 0u) cr |= (1u << 10); else cr &= ~(1u << 10);
    /* HSERDY bit17 follows HSEON bit16 */
    if ((cr & (1u << 16)) != 0u) cr |= (1u << 17); else cr &= ~(1u << 17);
    /* PLLRDY bit25 follows PLLON bit24 */
    if ((cr & (1u << 24)) != 0u) cr |= (1u << 25); else cr &= ~(1u << 25);
    r->regs[0] = cr;
}

static mm_u64 rcc_msi_hz(const struct rcc_state *r)
{
    static const mm_u64 ranges[] = {
        100000ull, 200000ull, 400000ull, 800000ull,
        1000000ull, 2000000ull, 4000000ull, 8000000ull,
        16000000ull, 24000000ull, 32000000ull, 48000000ull
    };
    mm_u32 cr = r->regs[RCC_CR / 4];
    mm_u32 idx = (cr >> 4) & 0x0fu;
    if (idx >= (mm_u32)(sizeof(ranges) / sizeof(ranges[0]))) {
        idx = 6u;
    }
    return ranges[idx];
}

static mm_u64 rcc_pll_p_clk(const struct rcc_state *r)
{
    mm_u32 pllcfgr = r->regs[RCC_PLLCFGR / 4];
    mm_u32 src = pllcfgr & 0x3u;
    mm_u64 fin = 0;
    mm_u32 divm = ((pllcfgr >> 4) & 0x0fu) + 1u;
    mm_u32 n = (pllcfgr >> 8) & 0x7fu;
    mm_u32 rdiv_sel = (pllcfgr >> 25) & 0x3u;
    mm_u32 rdiv = 2u;

