imbluedabr/m33mu/cpu/stm32l552/stm32l552_mmio.c
    if ((pllcfgr & (1u << 24)) == 0u) {
        return 0;
    }

    if (src == 1u) fin = rcc_msi_hz(r); /* MSI */
    else if (src == 2u) fin = 16000000ull; /* HSI16 */
    else if (src == 3u) fin = 8000000ull; /* HSE */
    else fin = 0;

    switch (rdiv_sel) {
    case 0u: rdiv = 2u; break;
    case 1u: rdiv = 4u; break;
    case 2u: rdiv = 6u; break;
    case 3u: rdiv = 8u; break;
    default: rdiv = 2u; break;
    }

    if (fin == 0 || divm == 0u || n == 0u || rdiv == 0u) {
        return 0;
    }
    return (fin / (mm_u64)divm) * (mm_u64)n / (mm_u64)rdiv;
}

static void rcc_update_sysclk(struct rcc_state *r)
{
    mm_u32 cfgr = r->regs[RCC_CFGR / 4];
    mm_u32 sw = cfgr & 0x3u;
    mm_u32 hpre = (cfgr >> 4) & 0xfu;
    mm_u64 sys = 0;
    mm_u32 div = 1u;

    if (sw == 0u) sys = rcc_msi_hz(r); /* MSI */
    else if (sw == 1u) sys = 16000000ull; /* HSI16 */
    else if (sw == 2u) sys = 8000000ull; /* HSE */
    else if (sw == 3u) sys = rcc_pll_p_clk(r);

    if (hpre >= 8u) {
        switch (hpre) {
        case 8u: div = 2u; break;
        case 9u: div = 4u; break;
        case 10u: div = 8u; break;
        case 11u: div = 16u; break;
        case 12u: div = 64u; break;
        case 13u: div = 128u; break;
        case 14u: div = 256u; break;
        case 15u: div = 512u; break;
        default: div = 1u; break;
        }
    }
    if (sys == 0) {
        r->cpu_hz = 0;
    } else {
        r->cpu_hz = sys / (mm_u64)div;
        if (r->cpu_hz == 0) r->cpu_hz = 1;
    }
    r->regs[RCC_CFGR / 4] = (r->regs[RCC_CFGR / 4] & ~(0x3u << 2)) | (sw << 2);
}

static mm_bool rcc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct rcc_state *r = (struct rcc_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RCC_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)r->regs + offset, &value, size_bytes);
    if (offset == RCC_CR) {
        rcc_update_ready(r);
    }
    if (offset == RCC_CFGR || offset == RCC_PLLCFGR || offset == RCC_CR) {
        rcc_update_sysclk(r);
    }
    return MM_TRUE;
}

static mm_bool pwr_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct pwr_state *p = (struct pwr_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > PWR_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)p->regs + offset, size_bytes);
    return MM_TRUE;
}

static void pwr_update_vos(struct pwr_state *p)
{
    mm_u32 sr2 = p->regs[PWR_SR2 / 4];
    sr2 &= ~(1u << 10); /* VOSF cleared -> ready */
    p->regs[PWR_SR2 / 4] = sr2;
}

static mm_bool pwr_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct pwr_state *p = (struct pwr_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > PWR_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)p->regs + offset, &value, size_bytes);
    if (offset == PWR_CR1) {
        pwr_update_vos(p);
    }
    return MM_TRUE;
}

static mm_bool simple_blk_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct simple_blk *b = (struct simple_blk *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GTZC_BLK_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)b->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool simple_blk_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct simple_blk *b = (struct simple_blk *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GTZC_BLK_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)b->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool mpcbb_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct mpcbb_state *b = (struct mpcbb_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > MPCBB_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)b->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool mpcbb_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct mpcbb_state *b = (struct mpcbb_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > MPCBB_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)b->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static void mpcbb_init_defaults(void)
{
    mm_u32 bank;
    for (bank = 0; bank < (mm_u32)(sizeof(mpcbb) / sizeof(mpcbb[0])); ++bank) {
        mm_u32 word;
        memset(&mpcbb[bank], 0, sizeof(mpcbb[bank]));
        for (word = 0; word < mpcbb_words[bank]; ++word) {
            mpcbb[bank].regs[(MPCBB_SECCFGR_OFFSET / 4u) + word] = 0xFFFFFFFFu;
        }
    }
}

static mm_bool gpio_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct gpio_state *g = ((struct gpio_state *)((void **)opaque)[0]);
    struct rcc_state *rcc = (struct rcc_state *)((void **)opaque)[2];
    int index = (int)(mm_uptr)((void **)opaque)[3];
    mm_bool is_secure_alias = ((void **)opaque)[1] != 0;
    mm_u32 seccfgr = g->regs[0x30u / 4];
    mm_u32 v = 0;
    mm_u32 mask = ~seccfgr; /* pins accessible to NS */

    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if (offset >= sizeof(g->regs)) return MM_FALSE;

    if (!gpio_clock_enabled(rcc, index)) {
        *value_out = 0;
        return MM_TRUE;
    }

    memcpy(&v, (mm_u8 *)g->regs + offset, size_bytes);

    if (!is_secure_alias) {
        if (offset == 0x30u) { /* SECCFGR */
            v = 0;
        } else if (offset == 0x10u || offset == 0x14u || offset == 0x18u || offset == 0x1cu || offset == 0x20u || offset == 0x24u || offset == 0x28u || offset == 0x2cu) {
            /* Data/bit set/reset/lock/AF/BRR/HSLVR: mask secure pins */
            v &= mask;
        } else if (offset <= 0x0cu || offset == 0x04u || offset == 0x08u) {
            /* config registers are readable but secure bits masked */
            v &= mask | (mask << 16); /* apply per-bit twice per 2 bits? conservative: mask low 16 bits */ 
        }
    }

